blog/2010/08/16/solar-form-solar_sql_model_record-and-solar_filter-complex-relationship-between-the-three-intertwined/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Solar_Form、Solar_Sql_Model_Record和Solar_Filter三者交织在一起的复杂关系 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>Solar_Form、Solar_Sql_Model_Record和Solar_Filter三者交织在一起的复杂关系</h1>
  <p>
<a href="http://roygu.com/?p=806">上一篇中我们聊到了Solar\_Filter</a>，那么今天我们聊一下<a href="http://solarphp.cn/apidoc/Solar_Form/Solar_Form.html">Solar\_Form</a>、<a href="http://solarphp.cn/apidoc/Solar_Sql_Model/Solar_Sql_Model_Record.html">Solar\_Sql\_Model\_Record</a>和<a href="http://solarphp.cn/apidoc/Solar_Filter/Solar_Filter.html">Solar\_Filter</a>。
</p>

<p>
谈到<a href="http://solarphp.cn/apidoc/Solar_Form/Solar_Form.html">Solar\_Form</a>就不得不谈谈<a href="http://solarphp.cn/apidoc/Solar_Sql_Model/Solar_Sql_Model_Record.html">Solar\_Sql\_Model\_Record</a>和<a href="http://solarphp.cn/apidoc/Solar_Filter/Solar_Filter.html">Solar\_Filter</a>了，大家在用的时候可能已经有这个疑问了：提交表单后，为什么Solar\_Form会显示那些invalid消息，而且效果跟Ajax一样，都不跳转页面的？我们今天就来解开谜题。
</p>

<p>
其这本质上是Solar\_Sql\_Model\_Record通过newForm()方法定制Solar\_Form，根据模型生成表单，然后根据提交过来的数据利用Solar\_Filter进行验证。为什么说是定制Solar\_Form呢？因为Solar\_Form在Solar System中是一个独立的Package，它不依赖于Record，所有它应当是自完备的，但Record的关心的重点都是从模型角度出发的，所以它只关心value, field等属性。所以你在newForm()方法中给表单域传入value或是invalids或是filters属性都是毫无意义的，因为这些工作Record可以完成并且必须由它完成（因为你是通过Record来生成Form）。
</p>

<p>
这就引入了一个新话题，那么不用Record，只用Solar\_Form和Solar\_Filter是否可以完成验证表单、提交等工作，以及幕后发生的事情是什么？我的回答是当然可以，不过这个等到下一篇文章来讲。
</p>

<p>
先放一段代码：
</p>


<pre class="example">
 public function actionAdd() {
    $this-&gt;item = $this-&gt;_model-&gt;blogs-&gt;fetchNew();
    if($this-&gt;_isProcess('save')){
        $data = $this-&gt;_request-&gt;post('blog');
        $this-&gt;item-&gt;load($data);
        $tags = explode(',', $data['tags']);
        $tag_all = $this-&gt;_model-&gt;tags-&gt;fetchAll();
        foreach($tags as $tag){
            $tag_r = $tag_all-&gt;appendNew(array(
                 'name' =&gt; trim($tag),
             ));

             $this-&gt;item-&gt;tags[] = $tag_r;
        }
        if($this-&gt;item-&gt;save()){
            $uri = "{$this-&gt;_controller}/edit/{$this-&gt;item-&gt;id}";
            return $this-&gt;_redirectNoCache($uri);
        }
    }

    $this-&gt;form = $this-&gt;item-&gt;newForm(array(
       'status' =&gt; array(
             'label' =&gt; '状态',
        ),
       'title' =&gt; array(
             'label' =&gt; '标题',
        ),
       'body' =&gt; array(
             'type' =&gt; 'textarea',
             'label' =&gt; '内容',
             'attribs' =&gt; array(
                 'style' =&gt; 'border:solid 1px black;',
                 'cols'  =&gt; '60',
                 'rows'  =&gt;  '10',
             ),
         ),
        'author_id' =&gt; array(
             'label'  =&gt;  '作者',
             'attribs' =&gt; array(
                 'style' =&gt; 'border:solid 1px red;',
                 ),
        ),
        'tags' =&gt; array(
             'label' =&gt; '标签',
             'descr' =&gt; '以逗号分隔',
        ),
    ));

    $this-&gt;_response-&gt;setNoCache();
}
</pre>


<p>
上面这段代码的操作是：
</p>


<ul class="org-ul">
<li></li>
</ul>















<p>
newForm()方法是无论如何都会执行的。那么何以提交前何表单的状态会变化呢？来看下newForm()的源码你肯定就会知道了。
</p>


<pre class="example">
public function newForm($cols = null)
    {
        // put into this array in the form
        $array_name = $this-&gt;_model-&gt;array_name;
        
        // build the form
        $form = Solar::factory('Solar_Form');
        $form-&gt;load('Solar_Form_Load_Model', $this-&gt;_model, $cols, $array_name);
        $form-&gt;setValues($this, $array_name);
        $form-&gt;addInvalids($this-&gt;_invalid, $array_name);
        
        // set the form status. if the record is invalid, always set the
        // form to failure.  if the record is valid, only set the form to
        // success when the form has not already been set to success.
        if ($this-&gt;isInvalid()) {
            
            // set the form to "failure"
            $form-&gt;setStatus(Solar_Form::STATUS_FAILURE);
            
        } elseif ($form-&gt;getStatus() !== Solar_Form::STATUS_FAILURE) {
            
            // set the form to "success" on these SQL statuses
            $success = array(
                self::SQL_STATUS_INSERTED,
                self::SQL_STATUS_UPDATED,
                self::SQL_STATUS_UNCHANGED,
            );
            
            if (in_array($this-&gt;getSqlStatus(), $success)) {
                $form-&gt;setStatus(Solar_Form::STATUS_SUCCESS);
            }
            
        }
        
        return $form;
    }
</pre>



<p>
注意看，首先实例化Solar\_Form，接着导入模型，然后对应模型给表单赋值，接着给表单添加invalid消息（如果有的话），如果确有invlid值，那么把Solar\_Form的状态标记为“失败”，并返回Solar\_Form对象。
</p>

<p>
那么对于Solar\_Form的显示，可以查看[[http://solarphp.cn/apidoc/Solar_View_Helper_Form/Solar_View_Helper_Form.html][Solar\_View\_Helper\_Form]]，它会显示Solar\_Form的所有信息，包括feed\_back、invalids及values。
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
